// Лабораторная работа 3. Удаление нелицевых (невидимых) граней выпуклого тела.
// Вариант 2. Параллельная проекция, тело задано в СКМ.
// Задача 7. Призма.

#include <cmath>

#include "facets.h"
#include "app.h"

bool App::running_ = true;

Facets model({
	{ 6, 0, 0 },

	{ 3, -1.1547005383792515f, 0 },
	{ 3, -0.5773502691896264f, -1},
	{ 3, 0.5773502691896264f, -1},
	{ 3, 1.1547005383792515f, 0 },
	{ 3, 0.5773502691896264f, 1},
	{ 3, -0.5773502691896264f, 1},

	{ -6, -1.1547005383792515f, 0 },
	{ -6, -0.5773502691896264f, -1},
	{ -6, 0.5773502691896264f, -1},
	{ -6, 1.1547005383792515f, 0 },
	{ -6, 0.5773502691896264f, 1},
	{ -6, -0.5773502691896264f, 1},
	}, {
		{ 0, 2, 3 },
		{ 2, 8, 9, 3 },

		{ 0, 1, 2 },
		{ 1, 7, 8, 2 },

		{ 0, 6, 1 },
		{ 6, 12, 7, 1 },

		{ 0, 5, 6 },
		{ 5, 11, 12, 6 },

		{ 0, 4, 5 },
		{ 4, 10, 11, 5 },

		{ 0, 3, 4 },
		{ 3, 9, 10, 4 },

		{ 7, 8, 9, 10, 11, 12 },
	});

void App::Run()
{
	running_ = true;
}

void App::Draw()
{
	Graphics g;

	// coordinate axes
	Camera::DrawLine(g, 0, 0, 0, 2, 0, 0, RGB(200, 0, 0));
	Camera::DrawLine(g, 0, 0, 0, 0, 2, 0, RGB(0, 200, 0));
	Camera::DrawLine(g, 0, 0, 0, 0, 0, 2, RGB(0, 0, 200));

	//
	model.Draw(g);
}

void App::Update()
{
	static float i = 0;

	Camera::LookAt(cos(i), sin(i), 0.58f); // z axis

	i += pi / 180;

	//model.Rotate(1, 0, 0);

	Draw();
}

void App::Init()
{

	Camera::Ortho(Graphics::width / 2, Graphics::height / 2, 40);

	Draw();
}
